**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import pandas as pd 
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']


df = pd.DataFrame(data)
df["Labels"] = labels
df.head()

        birds  age  visits priority Labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
 4   Labels    10 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 532.0+ bytes

**3. Print the first 2 rows of the birds dataframe **

In [7]:
df.head(2)

    birds  age  visits priority Labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [8]:
df[['birds' , 'age']]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [16]:
df.iloc[[2,3,7]][["birds" , "age" , "visits"]]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [17]:
df[df['visits'] < 4 ]

        birds  age  visits priority Labels
0      Cranes  3.5       2      yes      a
2     plovers  1.5       3       no      c
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [26]:
df[df["age"].isnull()][["birds" , "visits"]]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [30]:
df[(df["birds"] == "Cranes") & (df["age"] == 4)]

    birds  age  visits priority Labels
1  Cranes  4.0       4      yes      b

**9. Select the rows the age is between 2 and 4(inclusive)**

In [32]:
df[(df["age"] <=4) & (df['age'] >=2) ]

        birds  age  visits priority Labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
5      Cranes  3.0       4       no      f
9  spoonbills  4.0       2       no      j

**10. Find the total number of visits of the bird Cranes**

In [35]:
df[df['birds'] == "Cranes" ]["visits"].sum()

np.int64(12)

**11. Calculate the mean age for each different birds in dataframe.**

In [37]:
df.groupby("birds")["age"].mean()

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [ ]:
df.loc[len(df)] = [ "temp" , 4 , 2, "no" , "j"  ]

df = df.iloc[:-1]

**13. Find the number of each type of birds in dataframe (Counts)**

In [42]:
df["birds"].value_counts()

birds
Cranes        4
spoonbills    4
plovers       2
Name: count, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [43]:
df.sort_values(by="age" , ascending=False).sort_values(by="visits" , ascending=True)

        birds  age  visits priority Labels
6     plovers  5.5       2       no      g
9  spoonbills  4.0       2       no      j
0      Cranes  3.5       2      yes      a
7      Cranes  NaN       2      yes      h
2     plovers  1.5       3       no      c
4  spoonbills  6.0       3       no      e
8  spoonbills  8.0       3       no      i
1      Cranes  4.0       4      yes      b
5      Cranes  3.0       4       no      f
3  spoonbills  NaN       4      yes      d

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [46]:
df["priority"] = df["priority"].replace({
    "yes":1,
    "no" :0
})

df

C:\Users\ankush\AppData\Local\Temp\ipykernel_26760\4035793713.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["priority"] = df["priority"].replace({
C:\Users\ankush\AppData\Local\Temp\ipykernel_26760\4035793713.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["priority"] = df["priority"].replace({

        birds  age  visits  priority Labels
0      Cranes  3.5       2         1      a
1      Cranes  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5      Cranes  3.0       4         0      f
6     plovers  5.5       2         0      g
7      Cranes  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [48]:
df["birds"] = df["birds"].replace(
    {
        "Cranes": "trumpeters"
    }
)

df

C:\Users\ankush\AppData\Local\Temp\ipykernel_26760\960276459.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["birds"] = df["birds"].replace(

        birds  age  visits  priority Labels
0  trumpeters  3.5       2         1      a
1  trumpeters  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5  trumpeters  3.0       4         0      f
6     plovers  5.5       2         0      g
7  trumpeters  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j